/*
 * Нажмите nbfs://nbhost/SystemFileSystem/Templates/Licenses/license-default.txt 
   для изменения условий этой лицензии
 */
package com.home.task_2_1_ru;
import java.io.*;
/**
 *
 * @author PC
 */
public class Program 
{

    public static void main(String[] args) throws Exception
    {
        int a; // нижняя граница бозопасных показаний
        int b; // верхняя граница безоапсных показаний
        int n; // значения уровня помех
        int c = 0; // Счётчик безопасных показаний
        // Перемная для сохранения длины участка, где показания безопасны.
        int d = 0;
        // локальный максимум длина участка, где показания безопасны.
        int m; 
        // Максимальная длина участка, где показания безопасны. 
        // Окончательный ответ.
        int max_len = 0; 
        // Ввод данных
        var stdin=new BufferedReader(new InputStreamReader(System.in));
        System.out.println("Введите границы безопасности показаний");
        System.out.print("Нижняя граница: ");
        a = Integer.parseUnsignedInt(stdin.readLine());
        System.out.print("Верхнияя граница: ");
        b = Integer.parseUnsignedInt(stdin.readLine());
        System.out.println("Введите показания датчика орбитальной станции");
        System.out.println("0 - конец ввод данных");
        // Ввод первого значения уровня помех
        n = Integer.parseUnsignedInt(stdin.readLine());  
        while (n != 0) // Ввод показаний до момента, когда значение не равно 0.
        {
            if ((n >= a) && (n <= b))  // условие безопасности показаний
            {
                c++; // Увеличение счётчика безопасных показаний
            }
            else
            {
                d = c;  // Если показания опасны, запомнить количество 
                c = 0;  // безопасных и сбросить счётчик.
            }
            /*определить максимальную длину участка,
             где показания безопасны.Если был сброс счётчика
             (прервана цепочка безопасных данных), то максимальной длиной
             будет старое значение счётчика (перемменая "d").
            В противном случае - текущее (новое) 
            значение счётчика (переменное "c").
            */
            if (d > c)
                m = d;
            else
                m = c;
            /*Максимальную длину участка, где показания безопасны. 
             *Конечнй результат*/
            if (m > max_len)
            {
               max_len = m;
            }
            // ввод следющей порции данных
           n = Integer.parseUnsignedInt(stdin.readLine()); 
        }
        // Вывод информации на экран.
        System.out.println
        (
            "Длина интервала, где все показания безопасны: " + max_len
        );
    }
}